rest2task/EST_Tests/hwdrv/hw_src/MIMXRT1061/drivers/fsl_semc.c
    /* Base control. */
    if (config->rdyactivePolarity == kSEMC_RdyActivehigh)
    {
        base->MCR |= SEMC_MCR_WPOL0_MASK;
    }
    else
    {
        base->MCR &= ~SEMC_MCR_WPOL0_MASK;
    }
    result = SEMC_CovertMemorySize(base, config->memsize_kbytes, &memsize);
    if (result != kStatus_Success)
    {
        return result;
    }
    base->BR[5]  = (config->address & SEMC_BR_BA_MASK) | SEMC_BR_MS(memsize) | SEMC_BR_VLD_MASK;
    base->NORCR0 = SEMC_NORCR0_PS(config->portSize) | SEMC_NORCR0_BL(config->burstLen) |
                   SEMC_NORCR0_AM(config->addrMode) | SEMC_NORCR0_ADVP(config->advActivePolarity) |
                   SEMC_NORCR0_COL(config->columnAddrBitNum);

    /* Timing setting. */
    base->NORCR1 = SEMC_NORCR1_CES(SEMC_ConvertTiming(config->tCeSetup_Ns, clkSrc_Hz)) |
                   SEMC_NORCR1_CEH(SEMC_ConvertTiming(config->tCeHold_Ns, clkSrc_Hz)) |
                   SEMC_NORCR1_AS(SEMC_ConvertTiming(config->tAddrSetup_Ns, clkSrc_Hz)) |
                   SEMC_NORCR1_AH(SEMC_ConvertTiming(config->tAddrHold_Ns, clkSrc_Hz)) |
                   SEMC_NORCR1_WEL(SEMC_ConvertTiming(config->tWeLow_Ns, clkSrc_Hz)) |
                   SEMC_NORCR1_WEH(SEMC_ConvertTiming(config->tWeHigh_Ns, clkSrc_Hz)) |
                   SEMC_NORCR1_REL(SEMC_ConvertTiming(config->tReLow_Ns, clkSrc_Hz)) |
                   SEMC_NORCR1_REH(SEMC_ConvertTiming(config->tReHigh_Ns, clkSrc_Hz));
    base->NORCR2 =
#if defined(FSL_FEATURE_SEMC_HAS_NOR_WDS_TIME) && (FSL_FEATURE_SEMC_HAS_NOR_WDS_TIME)
        SEMC_NORCR2_WDS(SEMC_ConvertTiming(config->tWriteSetup_Ns, clkSrc_Hz)) |
#endif /* FSL_FEATURE_SEMC_HAS_NOR_WDS_TIME */
#if defined(FSL_FEATURE_SEMC_HAS_NOR_WDH_TIME) && (FSL_FEATURE_SEMC_HAS_NOR_WDH_TIME)
        SEMC_NORCR2_WDH(SEMC_ConvertTiming(config->tWriteHold_Ns, clkSrc_Hz)) |
#endif /* FSL_FEATURE_SEMC_HAS_NOR_WDH_TIME */
        SEMC_NORCR2_TA(SEMC_ConvertTiming(config->tTurnAround_Ns, clkSrc_Hz)) |
        SEMC_NORCR2_AWDH(SEMC_ConvertTiming(config->tAddr2WriteHold_Ns, clkSrc_Hz) + 1) |
        SEMC_NORCR2_LC(config->latencyCount) | SEMC_NORCR2_RD(config->readCycle) |
        SEMC_NORCR2_CEITV(SEMC_ConvertTiming(config->tCeInterval_Ns, clkSrc_Hz));
        
   
#if 1         // div 2      orig                   
     base->NORCR1 = SEMC_NORCR1_CES(0) |
                    SEMC_NORCR1_CEH(0) |
                    SEMC_NORCR1_AS(0) |
                    SEMC_NORCR1_AH(0) |
                    SEMC_NORCR1_WEL(10) |
                    SEMC_NORCR1_WEH(0) |
                    SEMC_NORCR1_REL(12) |
                    SEMC_NORCR1_REH(0);
#endif                    
 #if 0    // div 6                    
     base->NORCR1 = SEMC_NORCR1_CES(0) |
                    SEMC_NORCR1_CEH(0) |
                    SEMC_NORCR1_AS(0) |
                    SEMC_NORCR1_AH(0) |
                    SEMC_NORCR1_WEL(5) |
                    SEMC_NORCR1_WEH(3) |
                    SEMC_NORCR1_REL(5) |
                    SEMC_NORCR1_REH(0);
#endif   


    base->NORCR2 = SEMC_NORCR2_TA(0) |
                    SEMC_NORCR2_AWDH(0) |
                    SEMC_NORCR2_CEITV(0);

    return SEMC_ConfigureIPCommand(base, (config->portSize + 1));
}

/*!
 * brief Configures SRAM controller in SEMC.
 *
 * param base SEMC peripheral base address.
 * param config The sram configuration.
 * param clkSrc_Hz The SEMC clock frequency.
 */
status_t SEMC_ConfigureSRAM(SEMC_Type *base, semc_sram_config_t *config, uint32_t clkSrc_Hz)
{
    assert(config);

    uint8_t memsize;
    status_t result = kStatus_Success;

    uint32_t iocReg = base->IOCR & ~(SEMC_IOCR_PINMUXBITWIDTH << config->cePinMux);
    //uint32_t muxCe  = (config->cePinMux == kSEMC_MUXRDY) ?
    //                     SEMC_IOCR_PSRAM_CE - 1 :
    //                     ((config->cePinMux == kSEMC_MUXA8) ? SEMC_IOCR_PSRAM_CE_A8 : SEMC_IOCR_PSRAM_CE);

    /* IOMUX setting. */
  //  base->IOCR = iocReg | (muxCe << config->cePinMux);
    base->IOCR = 0xa30;

    /* Base control. */
    result = SEMC_CovertMemorySize(base, config->memsize_kbytes, &memsize);
    if (result != kStatus_Success)
    {
        return result;
    }
    base->BR[6]   = (config->address & SEMC_BR_BA_MASK) | SEMC_BR_MS(memsize) | SEMC_BR_VLD_MASK;
    base->SRAMCR0 = SEMC_SRAMCR0_PS(config->portSize) | SEMC_SRAMCR0_BL(config->burstLen) |
                    SEMC_SRAMCR0_AM(config->addrMode) | SEMC_SRAMCR0_ADVP(config->advActivePolarity) |
                    SEMC_SRAMCR0_COL_MASK;

    /* Timing setting. */
                    
    base->SRAMCR1 = SEMC_SRAMCR1_CES(0) |
                    SEMC_SRAMCR1_CEH(0) |
                    SEMC_SRAMCR1_AS(0) |
                    SEMC_SRAMCR1_AH(0) |
                    SEMC_SRAMCR1_WEL(15) |
                    SEMC_SRAMCR1_WEH(5) |
                    SEMC_SRAMCR1_REL(15) |
                    SEMC_SRAMCR1_REH(0);

    base->SRAMCR2 = SEMC_SRAMCR2_TA(0) |
                    SEMC_SRAMCR2_AWDH(0) |
                    SEMC_SRAMCR2_CEITV(0);

	 base->SRAMCR1 = SEMC_SRAMCR1_CES(0) |
                    SEMC_SRAMCR1_CEH(0) |
                    SEMC_SRAMCR1_AS(0) |
                    SEMC_SRAMCR1_AH(0) |
                    SEMC_SRAMCR1_WEL(10) |
                    SEMC_SRAMCR1_WEH(0) |
                    SEMC_SRAMCR1_REL(12) |
                    SEMC_SRAMCR1_REH(0);

    base->SRAMCR2 = SEMC_SRAMCR2_TA(0) |
                    SEMC_SRAMCR2_AWDH(0) |
                    SEMC_SRAMCR2_CEITV(0);
    return result;
}

/*!
 * brief Configures DBI controller in SEMC.
 *
 * param base SEMC peripheral base address.
 * param config The dbi configuration.
 * param clkSrc_Hz The SEMC clock frequency.
 */
status_t SEMC_ConfigureDBI(SEMC_Type *base, semc_dbi_config_t *config, uint32_t clkSrc_Hz)
{
    assert(config);

    uint8_t memsize;
    status_t result;

    if ((config->address < SEMC_STARTADDRESS) || (config->address > SEMC_ENDADDRESS))
    {
        return kStatus_SEMC_InvalidBaseAddress;
    }

    uint32_t iocReg = base->IOCR & ~(SEMC_IOCR_PINMUXBITWIDTH << config->csxPinMux);
    uint32_t muxCsx = (config->csxPinMux == kSEMC_MUXRDY) ?
                          SEMC_IOCR_DBI_CSX - 1 :
                          ((config->csxPinMux == kSEMC_MUXA8) ? SEMC_IOCR_DBI_CSX_A8 : SEMC_IOCR_DBI_CSX);

    /* IOMUX setting. */
    base->IOCR = iocReg | (muxCsx << config->csxPinMux);
    /* Base control. */
    result = SEMC_CovertMemorySize(base, config->memsize_kbytes, &memsize);
    if (result != kStatus_Success)
    {
        return result;
    }
    base->BR[7] = (config->address & SEMC_BR_BA_MASK) | SEMC_BR_MS(memsize) | SEMC_BR_VLD_MASK;
    base->DBICR0 =
        SEMC_DBICR0_PS(config->portSize) | SEMC_DBICR0_BL(config->burstLen) | SEMC_DBICR0_COL(config->columnAddrBitNum);

